# InvalidRoofCurveloopFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..InvalidRoofCurveloopFailure Property
BuiltInFailures..::..SketchFailures Class See Also
---
Base sketch for roof is invalid
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidRoofCurveloopFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidRoofCurveloopFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidRoofCurveloopFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace